docs: upgrade ascii diagrams to mermaid charts
